---
kind: type
id: T:Autodesk.Revit.DB.SpacingRuleJustification
source: html/34e9dad9-8bfe-4ae3-9521-8021dc10dcd1.htm
---
# Autodesk.Revit.DB.SpacingRuleJustification

Justification property of spacing rule

## Syntax (C#)
```csharp
public enum SpacingRuleJustification
```